#+TITLE:   ShopStop Expo Frontend
#+DATE:    April 09, 2020
#+SINCE:
#+STARTUP: inlineimages

** Install required JS packages using yarn
In order to run the development server the javascript packages and build tools
used have to be installed. These are installed using the following command:

#+BEGIN_SRC sh
# make sure you are in frontend/ when running these commands
yarn install
#+END_SRC

#+RESULTS:
| yarn  | install          | v1.22.4         |             |          |            |              |        |               |         |           |    |      |               |
| [1/4] | Resolving        | packages...     |             |          |            |              |        |               |         |           |    |      |               |
| [2/4] | Fetching         | packages...     |             |          |            |              |        |               |         |           |    |      |               |
| info  | fsevents@1.2.11: | The             | platform    | linux    | is         | incompatible | with   | this          | module. |           |    |      |               |
| info  | fsevents@1.2.11  | is              | an          | optional | dependency | and          | failed | compatibility | check.  | Excluding | it | from | installation. |
| [3/4] | Linking          | dependencies... |             |          |            |              |        |               |         |           |    |      |               |
| [4/4] | Building         | fresh           | packages... |          |            |              |        |               |         |           |    |      |               |
| Done  | in               | 9.26s.          |             |          |            |              |        |               |         |           |    |      |               |

